<a href="https://colab.research.google.com/github/ulrikSebastienR/2021-Coding-Basic/blob/main/sqlite3_10_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#https://www.sqlitetutorial.net/sqlite-python/sqlite-python-select/
import sqlite3
conn = sqlite3.connect('tasks.db')
print(conn)
cur = conn.cursor()
print(cur)

<sqlite3.Connection object at 0x7f2f9f5e2e30>
<sqlite3.Cursor object at 0x7f2f9b8d1f10>

In [ ]:
cur.execute('''CREATE TABLE IF NOT EXISTS projects(
  id integer PRIMARY KEY,
  name text NOT NULL,
  begin_date text,
  end_date text
);'''
)

In [ ]:
cur.execute(''' CREATE TABLE IF NOT EXISTS tasks(
id integer PRIMARY KEY,
name text NOT NULL,
priority integer,
project_id integer NOT NULL,
status_id integer NOT NULL,
begin_date text NOT NULL,
end_date text NULL,
FOREIGN KEY(project_id) REFERENCES projects (id)
);
''')

In [ ]:
#Now doing https://www.tutorialspoint.com/sqlite/sqlite_python.htm
import sqlite3
conn = sqlite3.connect('tasks1.db')
cur = conn.cursor()
print(conn, cur)

<sqlite3.Connection object at 0x7f2f9f5e2b90> <sqlite3.Cursor object at 0x7f2f9b8d1500>

In [ ]:
cur.execute('''CREATE TABLE IF NOT EXISTS company(
id integer PRIMARY KEY,
name TEXT NOT NULL,
age integer NOT NULL,
address CHAR(50),
salary REAL
);''')

In [ ]:
cur.execute('''
INSERT INTO company(id, name, age, address, salary) VALUES(1, 'Degree', 30, 'Charlie Street', 32000);
''')

In [ ]:
cur.execute('''
INSERT INTO company(id, name, age, address, salary) VALUES(3, 'Stevenson', 35, 'royal street', 340000)
''')

In [ ]:
cur.execute('''
INSERT INTO company(id, name, age, address, salary) VALUES(2, 'July', 23, 'her street', 12000)
''')

In [ ]:
cur.execute('''
INSERT INTO company(id, name, age, address, salary) VALUES(4, 'Mo', 50, 'Montepellier', 35000)
''')

In [ ]:
conn.total_changes

4

In [ ]:
cur.execute('''
SELECT * FROM company
''')

In [ ]:
cur.rowcount

-1

In [ ]:
result1 = cur.fetchall()
print(result1,type(result1))

[(1, 'Degree', 30, 'Charlie Street', 32000.0), (2, 'July', 23, 'her street', 12000.0), (3, 'Stevenson', 35, 'royal street', 340000.0), (4, 'Mo', 50, 'Montepellier', 35000.0)] <class 'list'>

In [ ]:
conn = sqlite3.connect('tasks1.db')
cur = conn.cursor()

In [ ]:
cur.execute('''
SELECT * FROM sqlite_master where type = 'table'
''')
print(cur.fetchall())

[('table', 'company', 'company', 2, 'CREATE TABLE company(\nid integer PRIMARY KEY,\nname TEXT NOT NULL,\nage integer NOT NULL,\naddress CHAR(50),\nsalary REAL\n)')]

In [ ]:
cur.execute('''
SELECT * FROM sqlite_master WHERE type = 'table'
''')
print(cur.fetchall())

[('table', 'company', 'company', 2, 'CREATE TABLE company(\nid integer PRIMARY KEY,\nname TEXT NOT NULL,\nage integer NOT NULL,\naddress CHAR(50),\nsalary REAL\n)')]

In [ ]:
cur.execute('''
SELECT name FROM sqlite_master WHERE type = 'table'
''')
print(cur.fetchall())

[('company',)]

In [ ]:
cur.execute('''
SELECT * from company
''')
print(cur.rowcount)
result2 = cur.fetchall()
print(result2)

-1
[]